kbhse/ESP8266_WeatherStation_MQTT/src/main.cpp
#define PROGNAM "ESP8266_WeatherStation_MQTT"                                                       // program name
#define VERSION "v04.18"                                                                            // program version (nb lowercase 'version' is keyword)
#define PGMFUNCT "Temperature, Humidity, Pressure, Light Intensity, Wind, CO2"                           // what the program does
#define HARDWARE "Wemos D1 mini or pro with sensors and shields"                                    // hardware version
#define AUTHOR "J Manson"                                                                           // created by
#define CREATION_DATE "9 April 2020"                                                                 // date
#define DEBUG_OUT

#include <Arduino.h>
#include <ESP8266WiFi.h>
#include "NDIR_I2C.h"                                                                               // CO2 sensor library https://github.com/SandboxElectronics/NDIR http://sandboxelectronics.com/?product=mh-z16-ndir-co2-sensor-with-i2cuart-5v3-3v-interface-for-arduinoraspeberry-pi
#include "SimpleTimer.h"                                                                            // https://playground.arduino.cc/Code/SimpleTimer/ https://github.com/marcelloromani/arduino/tree/master/SimpleTimer
#include "WEMOS_SHT3X.h"                                                                            // Wemos Temperature and Humidity shield library
#include "PubSubClient.h"                                                                           // https://github.com/knolleary/pubsubclient
#include "SoftwareSerial.cpp"                                                                       // https://github.com/plerup/espsoftwareserial
                                                                                                    // NB ESP needs this version of SoftwareSerial !! (and needs to be in PLatform IO lib)
#include "RBDdimmer.h"                                                                              // https://github.com/RobotDynOfficial/RBDDimmer

// MQTT code from: https://randomnerdtutorials.com/raspberry-pi-publishing-mqtt-messages-to-esp8266/
//                 https://github.com/knolleary/pubsubclient

// Functions
//
// void reconnect()                                                     This functions reconnects your ESP8266 to your MQTT broker
// void setup_wifi()
// void combSort11(float *ar, uint8_t n)
// void readSensors()                                                   Read the sensors and publish to MQTT. called by timer @ updateFreq
// void callback(String topic, byte* message, unsigned int length)      This functions is executed when a device publishes a message to a topic that an ESP8266 is subscribed to
// void setup()
// void loop()



// ------------------------------------------------------------------
// Pins

// ------------------------------------------------------------------
// Calibrate CO2 Sensor (self-calibration disabled in setup())
// Re-calibration of the sensor should be done in fresh air. After power on the sensor and put it in fresh air for at least 5 minutes.
// press the calibration button for at least 10 seconds
// ------------------------------------------------------------------

/* Changelog
04.00 average 10 samples
04.02 add routines to change update frequency from Node RED via MQTT
04.03 temporarily disable the averaging routine
04.04 fix esp8266 broadcasting unwanted open wifi network (in setup_wifi())
04.05 add credentials for BTHub6-7N5K
04.06 fix routines to change update frequency from Node RED via MQTT
04.07 adding RS485 wind sensors
04.08 winds peed implemented, publishing to MQTT
04.09 wind direction implemented
04.10 refactor
04.11 add CRC-16/MODBUS checksum function
04.12 adding CO2 sensor
04.14 turn onboard LED OFF by default (in setup)
04.17 add mySensor.disableAutoCalibration() in setup() for CO2 sensor
04.17 add filter for outlier rejection
*/

/*
ToDo:
CRC checksum for wind direction
set limits for sensor updateFreqs based on response times
remove averaging and median filters. just send raw data at updateFreq
(raw data to database, smoothing in Node RED)
WiFi reconnect routine
*/

// ------------------------------------------------------------------
// unique number for each ESP8266 device and edit the next 2 #defines accordingly
#define MQTT_DEVICE "esp20"                                                                         // MQTT requires unique device ID (see reconnect() function)
#define PUB_SUB_CLIENT esp20client                                                                  // and unique client ?
#define MQTT_LOCATION "fridge"                                                                    // location for MQTT topic
#define LED_STARTS_OFF                                                                            // initial state of on-board LED
//#define UPDATE_FREQ 60000L                                                                          // 60 seconds

long updateFreq = 0;                                                                                // the update frequency for sensors and publish to MQTT
int timerID;

// ------------------------------------------------------------------
// MQTT
const char* mqtt_server = "192.168.1.100";
const int mqttPort = 1883;
const char* mqttUser = "mqttUser2";
const char* mqttPassword = "jR5b73Wklx";

/*
const char* mqtt_server = "192.168.1.74";
const int mqttPort = 1883;
const char* mqttUser = "mqttUser";
const char* mqttPassword = "hTR7gxBY4";
*/

// ------------------------------------------------------------------
// Comment out sensors not in use

#define WEMOS_SHT30                                                                                 // Wemos Temperature and Humidity shield
//#define WEMOS_HP303                                                                                 // Wemos Barometric Pressure Shield
//#define WEMOS_BH1750                                                                                // Wemos Ambient Light Shield
//#define WEMOS_BATTERY                                                                               // Wemos Battery Shield
//#define RSSI                                                                                        // ESP8266 WiFi RSSI
//#define RS485_WIND                                                                                  // Anemometer and Wind Direction
//#define CO2                                                                                         // sandbox electronics CO2 sensor - NB recalibrate in fresh air regularly
//#define ROBOTDYN_ACDIMMER                                                                           // Robotdyn zero-crossing detector and AC dimmer module

// -----------------------------------------------------------------
// define which WiFi network to connect to (only 1 should be active)

#define BTHUB6
//#define BTHUBKBHSE              // NB not useable with this sketch because no MQTT Server on KBHSE Network
//#define LINKSYS

#ifdef BTHUB6                                                                                       // Weights Room
    const char* ssid = "BTHub6-7N5K";                                                               // new BTHub WiFi credentials
    const char* password = "QeC3RCJGeUvx";
#endif

#ifdef BTHUBKBHSE
    const char* ssid = "BT-HZA8HJ";                                                               // KBHSE BTHub WiFi credentials
    const char* password = "fyurGVup6qru3H";
#endif

#ifdef LINKSYS                                                                                      // Garage
    const char* ssid = "linksys";                                                                   // BTHub WiFi credentials
    const char* password = "rhenigidale";
#endif

// -----------------------------------------------------------------
// Initializes the espClient. You should change the espClient name if you have multiple ESPs running in your home automation system
//WiFiClient espClient;
WiFiClient PUB_SUB_CLIENT;
PubSubClient client(PUB_SUB_CLIENT);

// Lamp - LED - GPIO 4 = D2 on ESP-12E NodeMCU board
const int lamp = LED_BUILTIN;

// ------------------------------------------------------------------

#ifdef CO2
    #include <NDIR_I2C.h>
    NDIR_I2C mySensor(0x4D);                                  //Adaptor's I2C address (7-bit, default: 0x4D)
#endif

#ifdef WEMOS_SHT30
    #include "WEMOS_SHT3X.h"                                                                       // Wemos Temperature and Humidity shield
    SHT3X sht30(0x45);                                                                              // SHT30 shield has two user selectable I2C addresses
    //static char sht_temperature[7];
    //static char sht_humidity[7];
#endif

