kbhse/ESP8266_WeatherStation_MQTT/src/main.cpp
#ifdef WEMOS_HP303
    #include "LOLIN_HP303B.h"                                                                       // Wemos Barometric Pressure HP303B Shield https://github.com/wemos/LOLIN_HP303B_Library
    LOLIN_HP303B HP303B;
#endif

#ifdef WEMOS_BH1750                                                                                 // Wemos Ambient Light Shield
    #include "BH1750.h"                                                                             // ambient light sensor https://github.com/claws/BH1750
    BH1750 lightMeter(0x23);                                                                        // BH1750 can be configured to use two I2C addresses, 0x23 (default)or 0x5C
#endif

#ifdef RS485_WIND
    //const byte anemometerInquiryFrame[] = {0x01, 0x03, 0x00, 0x16, 0x00, 0x01, 0x65, 0xCE};            // Anemometer Inquiry frame
    //const byte windDirectionInquiryFrame[] = {0x02, 0x03, 0x00, 0x00, 0x00, 0x01, 0x84, 0x39};         // Wind Direction Sensor Inquiry frame
    byte responseFrameBuff[7] = {};                                                                    // buffer for receiving response frame from sensors
    //long updateFreq;                                                                                   // sensor update frequency (millis)
    float windSpeed;

    #define rxPin D7                                                                                  // SoftwareSerial receive pin
    #define txPin D6                                                                                  // SoftwareSerial transmit pin
    #define rtsPin D5                                                                                 // RS485 RTS direction control
    #define transmit HIGH
    #define receive LOW
    #define ledPin D4

    SoftwareSerial RS485(rxPin, txPin);                                                                // instantiate SoftwareSerial object

    // anemometer type B - not used
    // const byte anemometerInquiryFrame[] = {0x01, 0x03, 0x00, 0x16, 0x00, 0x01, 0x65, 0xCE};            // Anemometer Inquiry frame

    /*
    Anemometer on address 0x03
                              bytes
    device address:             1   0x03
    function number:            1   0x03
    start register address:     2   0x0000
    number of registers:        2   0x0001
    CRC-16/MODBUS               2   0x85E8
    */
    const byte anemometerInquiryFrame[] = {0x03, 0x03, 0x00, 0x00, 0x00, 0x01, 0x85, 0xE8};            // Wind Speed Sensor Inquiry frame
    /*
    the response frame should be:
                              bytes
    device address:             1   0x03
    function number:            1   0x03
    number of valid bytes       1   0x02
    data:                       2   0x0008
    CRC-16/MODBUS               2   0xC042          ** check this!

    data / 10 => speed m/s (0.8 m/s)

    range:              0 - 32.4 m/s
    precision:          0.3 m/s
    start speed:        0.8 m/s
    */

    /*
    Wind Direction Sensor on address 0x02
    */
    const byte windDirectionInquiryFrame[] = {0x02, 0x03, 0x00, 0x00, 0x00, 0x01, 0x84, 0x39};         // Wind Direction Sensor Inquiry frame

    /*
    Modbus Device address can be set to 0-255. You can set a new address by transmitting a frame
    with the first byte (the device address) set to 0x00. **Only do this with 1 device on the bus!
    Eg to set a device to address 3:
                          bytes
    device address:             1   0x00
    function number:            1   0x16
    start register address:     2   0x1000
    number of registers:        2   0x0001
    number of valid bytes       1   0x02
    SET new device address:     2   0x0003
    CRC-16/MODBUS               2   0x7A2A

    const byte modifyDeviceAddressFrame[] = {0x00, 0x16, 0x10, 0x00, 0x00, 0x01, 0x02, 0x00, 0x03, 0x7A, 0x2A};

    CRC-16/MODBUS online calculator: https://crccalc.com/
    the CRC is sent little-endian (low byte first)
    https://stackoverflow.com/questions/19347685/calculating-modbus-rtu-crc-16

    the response frame should be:
                              bytes
    device address:             1   0x00
    function number:            1   0x16
    start register address:     2   0x1000
    number of registers:        2   0x0001
    CRC-16/MODBUS               2   0x8CD8
    */

#endif

#ifdef ROBOTDYN_ACDIMMER
    #define dimmerPWMPin  D7
    #define zerocross  D6
    dimmerLamp dimmer(dimmerPWMPin, zerocross);                                                    // the class is dimmerLamp
    int outVal = 0;                                                                                // PWM Output value (%)
#endif

// ------------------------------------------------------------------

SimpleTimer timer;

// ------------------------------------------------------------------
// This functions reconnects your ESP8266 to your MQTT broker
// Change the function below if you want to subscribe to more topics with your ESP8266 
    void reconnect()
    {
    // Loop until we're reconnected
    while (!client.connected())
        {
        Serial.print("Attempting MQTT connection...");
        // Attempt to connect
        /*
        YOU MIGHT NEED TO CHANGE THIS LINE, IF YOU'RE HAVING PROBLEMS WITH MQTT MULTIPLE CONNECTIONS
        To change the ESP device ID, you will have to give a new name to the ESP8266.
        Here's how it looks:
            if (client.connect("ESP8266Client")) {
        You can do it like this:
            if (client.connect("ESP1_Office")) {
        Then, for the other ESP:
            if (client.connect("ESP2_Garage")) {
        That should solve your MQTT multiple connections problem
        */
        if (client.connect(MQTT_DEVICE, mqttUser, mqttPassword))
            {
            Serial.println("connected");  
            // Subscribe or resubscribe to a topic
            // You can subscribe to more topics (to control more LEDs in this example)
            client.subscribe(MQTT_LOCATION "/lamp");
            //client.subscribe(MQTT_LOCATION "/freq");
            client.subscribe("update/Freq/" MQTT_LOCATION);
            }
        else
            {
            Serial.print("failed, rc=");
            Serial.print(client.state());
            Serial.println(" try again in 5 seconds");
            // Wait 5 seconds before retrying
            delay(5000);
            }
        }
    }

// ------------------------------------------------------------------
void setup_wifi()
    {
    delay(10);
    // We start by connecting to a WiFi network
    Serial.println();
    Serial.print("Connecting to ");
    Serial.println(ssid);
    WiFi.begin(ssid, password);
    // the next line to fix esp8266 broadcasting unwanted open wifi network
    // it is placed AFTER WiFi.begin() !!
    // see: https://forum.arduino.cc/index.php?topic=501263.0 and https://github.com/esp8266/Arduino/issues/549
    WiFi.mode(WIFI_STA);
    while (WiFi.status() != WL_CONNECTED)
        {
        delay(500);
        Serial.print(".");
        }
    Serial.println("");
    Serial.print("WiFi connected - ESP IP address: ");
    Serial.println(WiFi.localIP());
    }

// ------------------------------------------------------------------

void combSort11(float *ar, uint8_t n)                                                               // this was used for median when temp samples stored in array
{
  uint8_t i, j, gap, swapped = 1;
  float temp;

  gap = n;
  while (gap > 1 || swapped == 1)
  {
    gap = gap * 10 / 13;
    if (gap == 9 || gap == 10) gap = 11;
    if (gap < 1) gap = 1;
    swapped = 0;
    for (i = 0, j = gap; j < n; i++, j++)
    {
      if (ar[i] > ar[j])
      {
        temp = ar[i];
        ar[i] = ar[j];
        ar[j] = temp;
        swapped = 1;
      }
    }
  }
}

// ------------------------------------------------------------------
#ifdef RS485_WIND
    // CRC-16/MODBUS calc function
    // https://stackoverflow.com/questions/19347685/calculating-modbus-rtu-crc-16

    uint16_t CRC16 (const byte *nData, uint16_t wLength)
        {
        static const uint16_t wCRCTable[] = {
        0x0000, 0xC0C1, 0xC181, 0x0140, 0xC301, 0x03C0, 0x0280, 0xC241,
        0xC601, 0x06C0, 0x0780, 0xC741, 0x0500, 0xC5C1, 0xC481, 0x0440,
        0xCC01, 0x0CC0, 0x0D80, 0xCD41, 0x0F00, 0xCFC1, 0xCE81, 0x0E40,
        0x0A00, 0xCAC1, 0xCB81, 0x0B40, 0xC901, 0x09C0, 0x0880, 0xC841,
        0xD801, 0x18C0, 0x1980, 0xD941, 0x1B00, 0xDBC1, 0xDA81, 0x1A40,
        0x1E00, 0xDEC1, 0xDF81, 0x1F40, 0xDD01, 0x1DC0, 0x1C80, 0xDC41,
        0x1400, 0xD4C1, 0xD581, 0x1540, 0xD701, 0x17C0, 0x1680, 0xD641,
        0xD201, 0x12C0, 0x1380, 0xD341, 0x1100, 0xD1C1, 0xD081, 0x1040,
        0xF001, 0x30C0, 0x3180, 0xF141, 0x3300, 0xF3C1, 0xF281, 0x3240,
        0x3600, 0xF6C1, 0xF781, 0x3740, 0xF501, 0x35C0, 0x3480, 0xF441,
        0x3C00, 0xFCC1, 0xFD81, 0x3D40, 0xFF01, 0x3FC0, 0x3E80, 0xFE41,
        0xFA01, 0x3AC0, 0x3B80, 0xFB41, 0x3900, 0xF9C1, 0xF881, 0x3840,
        0x2800, 0xE8C1, 0xE981, 0x2940, 0xEB01, 0x2BC0, 0x2A80, 0xEA41,
        0xEE01, 0x2EC0, 0x2F80, 0xEF41, 0x2D00, 0xEDC1, 0xEC81, 0x2C40,
        0xE401, 0x24C0, 0x2580, 0xE541, 0x2700, 0xE7C1, 0xE681, 0x2640,
        0x2200, 0xE2C1, 0xE381, 0x2340, 0xE101, 0x21C0, 0x2080, 0xE041,
        0xA001, 0x60C0, 0x6180, 0xA141, 0x6300, 0xA3C1, 0xA281, 0x6240,
        0x6600, 0xA6C1, 0xA781, 0x6740, 0xA501, 0x65C0, 0x6480, 0xA441,
        0x6C00, 0xACC1, 0xAD81, 0x6D40, 0xAF01, 0x6FC0, 0x6E80, 0xAE41,
        0xAA01, 0x6AC0, 0x6B80, 0xAB41, 0x6900, 0xA9C1, 0xA881, 0x6840,
        0x7800, 0xB8C1, 0xB981, 0x7940, 0xBB01, 0x7BC0, 0x7A80, 0xBA41,
        0xBE01, 0x7EC0, 0x7F80, 0xBF41, 0x7D00, 0xBDC1, 0xBC81, 0x7C40,
        0xB401, 0x74C0, 0x7580, 0xB541, 0x7700, 0xB7C1, 0xB681, 0x7640,
        0x7200, 0xB2C1, 0xB381, 0x7340, 0xB101, 0x71C0, 0x7080, 0xB041,
        0x5000, 0x90C1, 0x9181, 0x5140, 0x9301, 0x53C0, 0x5280, 0x9241,
        0x9601, 0x56C0, 0x5780, 0x9741, 0x5500, 0x95C1, 0x9481, 0x5440,
        0x9C01, 0x5CC0, 0x5D80, 0x9D41, 0x5F00, 0x9FC1, 0x9E81, 0x5E40,
        0x5A00, 0x9AC1, 0x9B81, 0x5B40, 0x9901, 0x59C0, 0x5880, 0x9841,
        0x8801, 0x48C0, 0x4980, 0x8941, 0x4B00, 0x8BC1, 0x8A81, 0x4A40,
        0x4E00, 0x8EC1, 0x8F81, 0x4F40, 0x8D01, 0x4DC0, 0x4C80, 0x8C41,
        0x4400, 0x84C1, 0x8581, 0x4540, 0x8701, 0x47C0, 0x4680, 0x8641,
        0x8201, 0x42C0, 0x4380, 0x8341, 0x4100, 0x81C1, 0x8081, 0x4040 };

