kbhse/ESP8266_WeatherStation_MQTT/src/main.cpp
        #ifdef DEBUG_OUT
            Serial.print("wind speed: ");
            for(byte i = 0; i < 7; i++)
                {
                Serial.print(responseFrameBuff[i], HEX);
                Serial.print(" ");
                }
            Serial.print(" ==> ");
            windSpeed = responseFrameBuff[4] / 10.0;
            Serial.print(windSpeed);
            Serial.print(" m/s");
            Serial.print(" checksum = ");
            Serial.print(checksum);
            if (crc == checksum)
                {
                Serial.println(" - OK");
                }
            else
                {
                Serial.println(" - WRONG");
                }
            
        #endif

        delay(100);   // needs delay here - why? duration?

        digitalWrite(rtsPin, transmit);                                                            // init transmission
        RS485.write(windDirectionInquiryFrame, sizeof(windDirectionInquiryFrame));                 // send the Inquiry
        RS485.flush();                                                                             // Wait for the transmission to complete

        digitalWrite(rtsPin, receive);                                                             // init receive
        RS485.readBytes(responseFrameBuff, 7);                                                     // read the data

        static char directionTemp[2];                                                              // client.publish() expects char array
        int direction = responseFrameBuff[4];                                                      // low byte
        itoa(direction, directionTemp, 10);                                                        // convert float to char array
        client.publish(MQTT_LOCATION "/windDirection", directionTemp);                             // publish to MQTT, topic /windSpeed

        digitalWrite(ledPin, HIGH);                                                                // flash the LED
        delay(100);
        digitalWrite(ledPin, LOW);

    #endif

  	} // end of readSensors()

// ------------------------------------------------------------------
// This functions is executed when a device publishes a message to a topic that an ESP8266 is subscribed to
// Change the function below to add logic to the program, so when a device publishes a message to a topic that 
// an ESP8266 is subscribed to it can do something
void callback(String topic, byte* message, unsigned int length)
    {
    Serial.print("Message arrived on topic: ");
    Serial.print(topic);
    Serial.print(". Message: ");
    String messageTemp;
  
    for (int i = 0; i < length; i++)
        {
        Serial.print((char)message[i]);
        messageTemp += (char)message[i];
        }
    Serial.println();

    // Feel free to add more if statements to control more GPIOs with MQTT

    // If a message is received on the topic room/lamp, you check if the message is either on or off. Turns the lamp GPIO according to the message
    // NB need to subscribe to topics in reconnect() !!

    //if(topic == MQTT_LOCATION "/freq")
    if(topic == "update/Freq/" MQTT_LOCATION)
        {
        updateFreq = messageTemp.toInt();
        Serial.print("freq: ");
        Serial.println(updateFreq);
        if(timer.isEnabled(timerID))                                                                // if timer has already been started (in setup())
            {
            timer.deleteTimer(timerID);
            timerID = timer.setInterval(updateFreq, readSensors);                                   // restart timer with new updateFreq
            }
        }

    if(topic == MQTT_LOCATION "/lamp")
        {
        Serial.print("Changing Room lamp to ");
        if(messageTemp == "on")
            {
            digitalWrite(lamp, LOW);                                                                // active LOW
            Serial.print("On");
            }
        else if(messageTemp == "off")
            {
            digitalWrite(lamp, HIGH);
            Serial.print("Off");
            }
        }

    if(topic == MQTT_LOCATION "/fanTempSetpoint")
        {
        //= messageTemp.toInt();


        }

    Serial.println();
    }   // end of callback()

// ------------------------------------------------------------------
void setup()
    {

    Serial.begin(115200);
    Serial.printf("\n\n%s_%s, %s, %s, %s, %s\n\n", PROGNAM, VERSION, AUTHOR, CREATION_DATE, MQTT_DEVICE, MQTT_LOCATION);

    pinMode(lamp, OUTPUT);
    #ifdef LED_STARTS_OFF
        digitalWrite(lamp, HIGH);                                                                      // turn onboard LED OFF
    #endif

    setup_wifi();
    client.setServer(mqtt_server, mqttPort);
    client.setCallback(callback);

    #ifdef CO2
        if (mySensor.begin())
            {
            Serial.println();
            Serial.println("Wait 10 seconds for CO2 sensor initialization...");
            delay(10000);
            }
        else
            {
            Serial.println("ERROR: Failed to connect to the sensor.");
            while(1);
            }
        mySensor.disableAutoCalibration();                                                         // stop the sensor self-calibration function (it expects sensor to be in fresh air at some point in a 24 hour period - which it isn't)
    #endif

    #ifdef WEMOS_HP303                                                                              // Wemos Barometric Pressure HP303B Shield
        HP303B.begin();                                                                             // I2C address = 0x77 (or HP303B.begin(0x76); //I2C address = 0x76)
    #endif

    #ifdef WEMOS_BH1750
        if (lightMeter.begin(BH1750::CONTINUOUS_HIGH_RES_MODE))                                     // begin returns a boolean that can be used to detect setup problems
            {
            Serial.println(F("BH1750 Advanced begin"));
            }
        else
            {
            Serial.println(F("Error initialising BH1750"));
            }
    #endif

    #ifdef RS485_WIND
        pinMode(rtsPin, OUTPUT);
        pinMode(ledPin, OUTPUT);
        RS485.begin(9600);
        delay(1000);
    #endif

    #ifdef ROBOTDYN_ACDIMMER
        dimmer.begin(NORMAL_MODE, ON);                      //dimmer initialisation: name.begin(MODE, STATE) 
    #endif
    
    if (!client.connected())
        {
        reconnect();
        }

    // request the update frequency (from Node RED)
    //client.publish(MQTT_LOCATION "/update", "freq");
    client.publish( "update/getFreq", MQTT_LOCATION);

