kbhse/ESP8266_WeatherStation_MQTT/src/main.cpp
    // wait for MQTT to publish the update frequency
    Serial.println("waiting for MQTT to publish the update frequency");
    while (updateFreq == 0) 
        {
        Serial.print(".");
        delay(500);
        client.loop();
        //yield();
        }
    //Serial.print("freq: ");
    //Serial.println(updateFreq);
 
    // start the timer
    timerID = timer.setInterval(updateFreq, readSensors);                                           // every x milliseconds, send data to MQTT

    Serial.print("timerID: ");
    Serial.println(timerID);

    } // end of setup()

// ------------------------------------------------------------------
void loop()
    {

    if (!client.connected())
        {
        reconnect();
        }
    if (!client.loop())
        {
        client.connect(MQTT_DEVICE);
        }

    timer.run();

    //outVal = map(analogRead(A0), 1, 1024, 20, 100);                                     // read potentiometer, analogRead(analog_pin), min_analog, max_analog, 20%, 100%);
    //dimmer.setPower(outVal); 

    } // end of loop()

// ------------------------------------------------------------------


/*
        // read 11 temperature measurements to array
        // there is a 500ms delay in call to sht30 so loop takes 5.5 seconds !!
        float temperature[11];
        //Serial.println(millis());
        for(int i = 0; i < 11; i++)
            {
            sht30.get();
            temperature[i] = sht30.cTemp;
            yield();
            }

        // use mid element of array as unsmoothed sample
        dtostrf(temperature[5], 6, 2, temperatureTemp);
        client.publish(MQTT_LOCATION "/temperature", temperatureTemp);  // and publish it to MQTT

        // print results array to console
        #ifdef DEBUG_OUT
            for(int i = 0; i < 11; i++)
                {
                Serial.print(i);
                Serial.print(": ");
                Serial.println(temperature[i]);
                }
        #endif

        // find highest and lowest values (outliers)
        int hi = 0, lo = 0;
        for(int i = 1; i <= 9; i++)
            {
            if(temperature[i] > temperature[hi])
                {
                hi = i;
                }
            if(temperature[i] < temperature[lo])
                {
                lo = i;
                }
            }
        // reject outliers
        temperature[hi] = 0;
        temperature[lo] = 0;

        // calc average of 11 values
        float averageTemperature = 0;
        for(int i = 0; i < 11; i++)
            {
            averageTemperature += temperature[i];
            }
        averageTemperature /= 11;

        #ifdef DEBUG_OUT
            Serial.println();
            Serial.print("average: ");
            Serial.println(averageTemperature);
            Serial.println();
        #endif

        combSort11(temperature, 11);
        // print results to console
        #ifdef DEBUG_OUT
            for(int i = 0; i < 11; i++)
                {
                Serial.print(i);
                Serial.print(": ");
                Serial.println(temperature[i]);
                }
        #endif
        float medianTemperature = temperature[5];

        // publish median temperature to mqtt
        dtostrf(medianTemperature, 6, 2, temperatureTemp);
        client.publish(MQTT_LOCATION "/medianTemperature", temperatureTemp);

        #ifdef DEBUG_OUT
            Serial.println();
            Serial.print("median: ");
            Serial.println(medianTemperature);
            Serial.println();
        #endif
*/